cmsis-svd/cmsis-svd/data/Infineon/s6e2hgxe.svd
        <!-- REGISTER "ADCMP_ACFS54" -->
        <register derivedFrom="ADCMP_ACFS10">
          <name>ADCMP_ACFS54</name>
          <description>ADCMP ch.4/5 Connecting FRT Select Register</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x172</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP0" -->
        <register>
          <name>ADCMP_ACMP0</name>
          <description>ADCMP ch.0 Compare Value Store Register</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1BA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ACMP" -->
            <field>
              <name>ACMP</name>
              <description>0</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACMP1" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP1</name>
          <description>ADCMP ch.1 Compare Value Store Register</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1BE</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP2" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP2</name>
          <description>ADCMP ch.2 Compare Value Store Register</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1C2</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP3" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP3</name>
          <description>ADCMP ch.3 Compare Value Store Register</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1C6</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP4" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP4</name>
          <description>ADCMP ch.4 Compare Value Store Register</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1CA</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP5" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP5</name>
          <description>ADCMP ch.5 Compare Value Store Register</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1CE</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSA" -->
        <register>
          <name>ADCMP_ACSA</name>
          <description>ADCMP Control Register A</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1D0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3F3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL54" -->
            <field>
              <name>SEL54</name>
              <description>selects compatible operation of ADCMP ch.5 and ch.4 with FM3 Family products</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL32" -->
            <field>
              <name>SEL32</name>
              <description>selects compatible operation of ADCMP ch.3 and ch.2 with FM3 Family products</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL10" -->
            <field>
              <name>SEL10</name>
              <description>selects compatible operation of ADCMP ch.1 and ch.0 with FM3 Family products</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CE54" -->
            <field>
              <name>CE54</name>
              <description>enables/disables compatibility of ADCMP ch.5 and ch.4 with FM3 Family products</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CE32" -->
            <field>
              <name>CE32</name>
              <description>enables/disables compatibility of ADCMP ch.3 and ch.2 with FM3 Family products</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CE10" -->
            <field>
              <name>CE10</name>
              <description>enables/disables compatibility of ADCMP ch.1 and ch.0 with FM3 Family products</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACSC0" -->
        <register>
          <name>ADCMP_ACSC0</name>
          <description>ADCMP ch.0 Control Register C</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1D4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "APBM" -->
            <field>
              <name>APBM</name>
              <description>sets the linked transfer with the FRT interrupt mask counter</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADSEL" -->
            <field>
              <name>ADSEL</name>
              <description>specify the destinations of ADC start signals that are output by ADCMP</description>
              <msb>4</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUFE" -->
            <field>
              <name>BUFE</name>
              <description>select enable/disable and transfer timing for buffer function of the ACMP register.</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACSD0" -->
        <register>
          <name>ADCMP_ACSD0</name>
          <description>ADCMP ch.0 Control Register D</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1D5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xF3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ZE" -->
            <field>
              <name>ZE</name>
              <description>enables/disables the operation of the ADCMP when the FRT is "0x0000"</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UE" -->
            <field>
              <name>UE</name>
              <description>enables/disables the operation of the ADCMP that is counting up for the connected FRT</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>enables/disables the operation of the ADCMP that is counting down at the Peak value of the connected FRT</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DE" -->
            <field>
              <name>DE</name>
              <description>enables/disables the operation of the ADCMP that is counting down for the connected FRT</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCUS" -->
            <field>
              <name>OCUS</name>
              <description>selects the OCU OCCP register that will become the start for offset start</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AMOD" -->
            <field>
              <name>AMOD</name>
              <description>selects operation mode for ADCMP</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACMC0" -->
        <register>
          <name>ADCMP_ACMC0</name>
          <description>ADCMP ch.0 Mask Compare Value Storage Register</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1D6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xCF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MPCE" -->
            <field>
              <name>MPCE</name>
              <description>specifies whether a comparison is performed with the FRT peak interrupt mask counter</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MZCE" -->
            <field>
              <name>MZCE</name>
              <description>specifies whether a comparison is performed with the FRT zero interrupt mask counter</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AMC" -->
            <field>
              <name>AMC</name>
              <description>specifies the value to be compared with the FRT interrupt mask counter</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACSC1" -->
        <register derivedFrom="ADCMP_ACSC0">
          <name>ADCMP_ACSC1</name>
          <description>ADCMP ch.1 Control Register C</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1D8</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSD1" -->
        <register derivedFrom="ADCMP_ACSD0">
          <name>ADCMP_ACSD1</name>
          <description>ADCMP ch.1 Control Register D</description>
          <alternateGroup>ADCMP</alternateGroup>
          <addressOffset>0x1D9</addressOffset>
        </register>
