cmsis-svd/cmsis-svd/data/Infineon/s6e2hgxe.svd
        <!-- REGISTER "IF1MSK" -->
        <register>
          <name>IF1MSK</name>
          <description>IF1 Mask Registers</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xDFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MXTD" -->
            <field>
              <name>MXTD</name>
              <description>MXtd</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MDIR" -->
            <field>
              <name>MDIR</name>
              <description>MDir</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK" -->
            <field>
              <name>MSK</name>
              <description>Msk</description>
              <msb>28</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1ARB" -->
        <register>
          <name>IF1ARB</name>
          <description>IF1 Arbitration Registers</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSGVAL" -->
            <field>
              <name>MSGVAL</name>
              <description>MsgVal</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "XTD" -->
            <field>
              <name>XTD</name>
              <description>Xtd</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIR" -->
            <field>
              <name>DIR</name>
              <description>Dir</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID" -->
            <field>
              <name>ID</name>
              <description>ID</description>
              <msb>28</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1MCTR" -->
        <register>
          <name>IF1MCTR</name>
          <description>IF1 Message Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF8F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NEWDAT" -->
            <field>
              <name>NEWDAT</name>
              <description>NewDat</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSGLST" -->
            <field>
              <name>MSGLST</name>
              <description>MsgLst</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTPND" -->
            <field>
              <name>INTPND</name>
              <description>IntPnd</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UMASK" -->
            <field>
              <name>UMASK</name>
              <description>UMask</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXIE" -->
            <field>
              <name>TXIE</name>
              <description>TxIE</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXIE" -->
            <field>
              <name>RXIE</name>
              <description>RxIE</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RMTEN" -->
            <field>
              <name>RMTEN</name>
              <description>RmtEn</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXRQST" -->
            <field>
              <name>TXRQST</name>
              <description>TxRqst</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EOB" -->
            <field>
              <name>EOB</name>
              <description>EoB</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DLC" -->
            <field>
              <name>DLC</name>
              <description>DLC</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1DTA_L" -->
        <register>
          <name>IF1DTA_L</name>
          <description>IF1 Data Registers A</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA3" -->
            <field>
              <name>DATA3</name>
              <description>Data(3) Little Endian</description>
              <msb>31</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA2" -->
            <field>
              <name>DATA2</name>
              <description>Data(2) Little Endian</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA1" -->
            <field>
              <name>DATA1</name>
              <description>Data(1) Little Endian</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA0" -->
            <field>
              <name>DATA0</name>
              <description>Data(0) Little Endian</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1DTB_L" -->
        <register>
          <name>IF1DTB_L</name>
          <description>IF1 Data Registers B</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA7" -->
            <field>
              <name>DATA7</name>
              <description>Data(7) Little Endian</description>
              <msb>31</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA6" -->
            <field>
              <name>DATA6</name>
              <description>Data(6) Little Endian</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA5" -->
            <field>
              <name>DATA5</name>
              <description>Data(5) Little Endian</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA4" -->
            <field>
              <name>DATA4</name>
              <description>Data(4) Little Endian</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1DTA_B" -->
        <register>
          <name>IF1DTA_B</name>
          <description>IF1 Data Registers A</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA0" -->
            <field>
              <name>DATA0</name>
              <description>Data(0) Big Endian</description>
              <msb>31</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA1" -->
            <field>
              <name>DATA1</name>
              <description>Data(1) Big Endian</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA2" -->
            <field>
              <name>DATA2</name>
              <description>Data(2) Big Endian</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA3" -->
            <field>
              <name>DATA3</name>
              <description>Data(3) Big Endian</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1DTB_B" -->
        <register>
          <name>IF1DTB_B</name>
          <description>IF1 Data Registers B</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA4" -->
            <field>
              <name>DATA4</name>
              <description>Data(4) Big Endian</description>
              <msb>31</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA5" -->
            <field>
              <name>DATA5</name>
              <description>Data(5) Big Endian</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA6" -->
            <field>
              <name>DATA6</name>
              <description>Data(6) Big Endian</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA7" -->
            <field>
              <name>DATA7</name>
              <description>Data(7) Big Endian</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
